Revit 2027 API
CircuitNamingScheme.SetCombinedParameters Method
 Sets combined parameters array.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCombinedParameters(
	IList<TableCellCombinedParameterData> data
)
Public Sub SetCombinedParameters (
	data As IList(Of TableCellCombinedParameterData)
)
public:
void SetCombinedParameters(
	IList<TableCellCombinedParameterData^>^ data
)
member SetCombinedParameters :
        data : IList<TableCellCombinedParameterData> -> unit
Parameters
data IList<TableCellCombinedParameterData>
 The array of TableCellCombinedParameterData to be set as combined parameters.
Exceptions
Exception | Condition
ArgumentException |  The data contains invalid parameter id.
ArgumentNullException |  A non-optional argument was null
Remarks
Currently the following parameters are supported:
Project Parameters
Shared Parameters
RBS_ELEC_CIRCUIT_NAME
RBS_ELEC_CIRCUIT_PANEL_PARAM
RBS_ELEC_CIRCUIT_TYPE
CIRCUIT_LOAD_CLASSIFICATION_ABBREVIATION_PARAM
RBS_ELEC_CIRCUIT_NAMING_INDEX
RBS_ELEC_NUMBER_OF_POLES
RBS_ELEC_CIRCUIT_RATING_PARAM
RBS_ELEC_CIRCUIT_FRAME_PARAM
RBS_ELEC_VOLTAGE
CIRCUIT_PHASE_PARAM
CIRCUIT_WAYS_PARAM
RBS_ELEC_CIRCUIT_SLOT_INDEX
See Also
Reference
CircuitNamingScheme Class
Autodesk.Revit.DB.Electrical Namespace